ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ideas</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ideas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org531925e">Zines, tiktoks, artwork, etc</a></li>
<li><a href="#org860ad5b">Education is important</a></li>
<li><a href="#org59a54be">Mapping ACORN's structure</a></li>
<li><a href="#orga94d456">Finding out what happened to ACORN Oxford</a></li>
<li><a href="#orgdf059a3">Reaching out to IWW</a></li>
<li><a href="#org13a14bf">How do atomised ACORN members organise?</a></li>
<li><a href="#orgff8824a"><span class="todo TODO">TODO</span> What is the best platform for developing ideas?</a></li>
<li><a href="#orgb5f484a"><span class="todo TODO">TODO</span> Publically talking about our issues</a></li>
<li><a href="#org7154694"><span class="todo TODO">TODO</span> would be cool to have ACORN newsletters</a></li>
<li><a href="#orge5c020c"><span class="todo TODO">TODO</span> List of things I think could be changed to improve ACORN</a></li>
</ul>
</div>
</div>

<div id="outline-container-org531925e" class="outline-2">
<h2 id="org531925e">Zines, tiktoks, artwork, etc</h2>
<div class="outline-text-2" id="text-org531925e">
<p>
Seems completely obvious that art is important to tenant unions, and
</p>

<p>
Despite being filled with really creative people,
</p>

<p>
Why are all ACORN spaces so boring?
</p>

<p>
This seems like a really good thing to
</p>
</div>
</div>

<div id="outline-container-org860ad5b" class="outline-2">
<h2 id="org860ad5b">Education is important</h2>
<div class="outline-text-2" id="text-org860ad5b">
<p>
This is a hot-take in ACORN circles but political education is necessary, not something that we can avoid.
</p>

<p>
So many reasons about why education is important for ACORN to effectively run and also so many wildly different attitudes.
</p>

<p>
We need to learn from other organisations so we know what we need to be avoiding and what we need to be aiming towards.
</p>

<p>
I am thinking of the Comrade Delta scandal that occurred in the SWP.
</p>

<p>
examples of what we are trying to avoid. Comrade Delta scandal that effected SWP. What caused this to happen? What are lessons? Labour Party anti-democratic purging. What is way to prevent right wing bureaucracy controlling organisation behind the scenes?
</p>

<p>
Alternatively what are organisations that don't have this problem, what are the qualities in these organisations?
</p>
</div>
</div>

<div id="outline-container-org59a54be" class="outline-2">
<h2 id="org59a54be">Mapping ACORN's structure</h2>
<div class="outline-text-2" id="text-org59a54be">
<p>
Want to create an factual resource that explains ACORN's structure, rules, etc. that all members should get if the handbook was actually accessible. Maybe some explanation of things like what ACORN provides us (e.g. thing about it providing legal insurance, not sure what this was called?) Particular things I'm want to explain about ACORN are things relevant to questions like: can we use ACORN's democratic procedures to reform it and how? or what does ACORN provide us that a branch would lose through disaffiliating.
</p>

<p>
Started this on this <a href="mapping acorn.html">mapping acorn page.</a>
</p>
</div>
</div>

<div id="outline-container-orga94d456" class="outline-2">
<h2 id="orga94d456">Finding out what happened to ACORN Oxford</h2>
<div class="outline-text-2" id="text-orga94d456">
<p>
ACORN Oxford has been described to me as being a very active branch with 200 members and 60 (!) active members. When it collapsed (or destroyed by National?) it seems not to have been able to survive (might be because the organisers who set it up all burnt out or there was something that ACORN was providing that they could not replicate on their own).
</p>

<p>
I want to find out what happened to ACORN Oxford, maybe Youtube mini-documentary style that looks from perspective of different people, e.g. would be great to see it from perspective of the organisers in Oxford, and also speculate/or just ask National's issues with way ACORN operated.
</p>

<p>
Could also do same thing for ACORN Aberyswythe and Lancaster if if it is possible. If anyone wants to work on this with me like definitely let me know.
</p>
</div>
</div>

<div id="outline-container-orgdf059a3" class="outline-2">
<h2 id="orgdf059a3">Reaching out to IWW</h2>
<div class="outline-text-2" id="text-orgdf059a3">
<p>
The <a href="https://libcom.org/article/acorn-no-mighty-oak">https://libcom.org/article/acorn-no-mighty-oak</a> article (and IWW articles available online) depict Wade as a union busting authoritarian. Wade is frequently invited to ACORN UK events though (e.g. turning up to the ACORN Sheffield Annual General Meeting for the end of 2023) and if you ask Nick Ballard about it he will say that the IWW are ultra-leftists and they don't really have a valid criticism, and in fact Wade is a "genius" who deserves his guru status in ACORN UK.
</p>

<p>
I find the Libcom article more convincing than Nick Ballard's perspective (I have listened to the Wade's World podcast and am not convinced that this man is a genius) but it would be useful to get people from IWW (in London where they fell out )
</p>

<p>
More generally, I have been informed that ACORN has fallen out with different left wing groups, e.g. IWW branch in UK in
</p>
</div>
</div>

<div id="outline-container-org13a14bf" class="outline-2">
<h2 id="org13a14bf">How do atomised ACORN members organise?</h2>
<div class="outline-text-2" id="text-org13a14bf">
<p>
If ACORN National is actively hostile to attempts amongst members to democratise the organisation (maybe to hold onto the privileged positions and cushy jobs that make them feel important) then it seems unlikely that they will want members to
</p>

<p>
This is actually a difficult problem
</p>
</div>
</div>

<div id="outline-container-orgff8824a" class="outline-2">
<h2 id="orgff8824a"><span class="todo TODO">TODO</span> What is the best platform for developing ideas?</h2>
<div class="outline-text-2" id="text-orgff8824a">
<p>
In my opinion in person meetings are not
</p>

<p>
I think the thinking of
</p>

<p>
I am using this website because there isn't anything else to use, but it isn't great, mainly because it is just for me. If people want to reply to anything I am writing they need to know me. If they want to use this website to host it so that other people can easily access it they need to go through me, so it isn't democratic. Ideally would be some union-wide platform that can be used.
</p>
</div>
</div>


<div id="outline-container-orgb5f484a" class="outline-2">
<h2 id="orgb5f484a"><span class="todo TODO">TODO</span> Publically talking about our issues</h2>
<div class="outline-text-2" id="text-orgb5f484a">
<p>
This is my opinion that is probably the most disagreed with and caused me to get shouted at by ACORN members who are otherwise in complete agreement that ACORN needs reform. I think there is kind of a taboo on the left about being critical, and this comes from mentality people have about
</p>

<p>
Weekly Worker and Cosmonaut are both part of particular strain of Marxist that have unusual position with regard to this question. They are far more free speech, and this is not a popular position in mainstream left wing spaces, and so I've never actually felt I can confidently explain it (also owing to my half-baked understanding of most left wing ideas anyway).
</p>

<p>
I want to get something into Cosmonaut or Weekly Worker. There are lots of people who are interested in building a tenant union, although they are outside of ACORN. I like the work that is published in Cosmonaut Magazine which is American Marxist publication, also work in Weekly Worker that is UK old-head Marxist publication, but I know for sure there are other publications that would also be sympathetic and probably accept articles we send in if they are framed in a way that is accessible and something that fits into ongoing
</p>
</div>
</div>

<div id="outline-container-org7154694" class="outline-2">
<h2 id="org7154694"><span class="todo TODO">TODO</span> would be cool to have ACORN newsletters</h2>
<div class="outline-text-2" id="text-org7154694">
<p>
Create a news letter that is Member Led. Every few weeks we could publish new News Letter through FB, WhatsApp, email, whatever. The newsletter could be very casual informal content like thoughts people have, suggestions, artwork, whatever. It would be edited together to make something that should inform both peripheral Acorn members as well as non-Acorn members (e.g. if we shared on FB).
</p>

<p>
This would be a good supplement to how we already inform people of what we've been up to, which is having them explained during an AMM.
</p>
</div>

<div id="outline-container-org492c4e4" class="outline-3">
<h3 id="org492c4e4">Content</h3>
<div class="outline-text-3" id="text-org492c4e4">
<ul class="org-ul">
<li>An "Events" page that is dates that will happen over next 2 weeks.</li>
<li>what we've been up to section</li>
<li>any other user submissions
<ul class="org-ul">
<li>suggestions, feedback, constructive criticism, etc.</li>
<li>news that is important to tenants</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge5c020c" class="outline-2">
<h2 id="orge5c020c"><span class="todo TODO">TODO</span> List of things I think could be changed to improve ACORN</h2>
<div class="outline-text-2" id="text-orge5c020c">
<p>
In my opinion, most of these suggestions couldn't happen without first democraticising ACORN (because making an ACORN branch effective seems to be quickest way for them to be shut down ACORN National), but leaving that aside I have list of things I think could make ACORN run better:
</p>
</div>
<div id="outline-container-org5f1b966" class="outline-3">
<h3 id="org5f1b966">ACORN Handbook, Bylaws, and Legal Advice shouldn't be on a Google Doc</h3>
<div class="outline-text-3" id="text-org5f1b966">
<p>
Keeping all important and useful information on Google Docs is not the way. A lot of it does not make sense to be kept private, or the reasons for keeping it private are massively outweighed by problems this creates. For example, legal advice to avoid us getting sued. Its nightmare actually finding this. There was a google doc for it but the link randomly changed. The only way for a member to find this is to ask a committee member for it, and like this is a big hassle. Even when you have a link to it it can just randomly change.
</p>
</div>
</div>

<div id="outline-container-org0c187fc" class="outline-3">
<h3 id="org0c187fc">Only use staff for things staff <i>need</i> to do</h3>
<div class="outline-text-3" id="text-org0c187fc">
<p>
Currently it seems staff are used for door-knocking. Like this seems like a waste of resources
</p>
</div>
</div>
<div id="outline-container-orgba916b4" class="outline-3">
<h3 id="orgba916b4">Make a free-tier way to join as a member</h3>
<div class="outline-text-3" id="text-orgba916b4">
<p>
Have a free-tier for people to be involved without having to pay for membership
</p>
</div>
</div>

<div id="outline-container-org0c6e7d0" class="outline-3">
<h3 id="org0c6e7d0"><span class="todo TODO">TODO</span> How ACORN handles member defense cases that can be improved</h3>
<div class="outline-text-3" id="text-org0c6e7d0">
<ul class="org-ul">
<li>explain hot take about things that seem obviously counterproductive about how ACORN member defense cases work.</li>
</ul>
</div>
</div>

<div id="outline-container-org247a591" class="outline-3">
<h3 id="org247a591"><span class="todo TODO">TODO</span> Separate the function</h3>
<div class="outline-text-3" id="text-org247a591">
<p>
For example, sole function o
Currently the sole responsibility for agitprop falls f
</p>

<p>
As far as I know there is big gap in type of training that we do for
</p>

<p>
Separate the person from the function that they are meant to be doing. The way ACORN currently
</p>
</div>
</div>
</div>
</div>
</body>
</html>
